#include <stdio.h>
#include <windows.h>
#define N 10
// 输出二维数组的有关数据（地址或元素的值）
int main()
{
    int a[3][4] = {
        {11,12,13,14},
        {21,22,23,24},
        {31,32,33,34},
    };

    // a[0][0]的值
    printf("%d,%d,%d\n", a[0][0], ** a, * a[0]);
    // a[0][0]的地址
    printf("%d,%d,%d,%d,%d\n\n", &a[0][0], a, * a, a[0], * (a + 0));

    // 第一行起始地址
    printf("%d,%d\n", &a[1], a + 1);
    // a[1][0]的值
    printf("%d,%d,%d\n", a[1][0], * a[1], * (* (a + 1) + 0));
    // a[1][0]的地址
    printf("%d,%d,%d,%d\n\n", &a[1][0], a[1], * (a + 1) + 0, a + 1);
    // a[1][2]的值
    printf("%d,%d,%d\n", a[1][2], * (a[1] + 2),* (* (a + 1) + 2));
    // a[1][2]的地址
    printf("%d,%d,%d\n\n", &a[1][2], a[1] + 2, * (a + 1) + 2);
    system("pause");
    return 0;
}