#include <stdio.h>
#include <windows.h>
// 输出1~n^2的自然数构成的魔方阵
// 魔方阵：它的每一行，每一列，对角线之和均相等
int main()
{
    int i, j, n, k, p, a[15][15];
    // 确保输入范围有效
    p = 1;
    while (p == 1)
    {
        printf("输入范围1~15的奇数，生成一个魔方阵：");
        scanf("%d", &n);
        if (n >= 0 && n <= 15 && n % 2 != 0)
            p = 0;
    }
    // 初始化
    for (i = 0; i < n; i++)
    {
        for (j = 0; j < n; j++)
        {
            a[i][j] = 0;
        }
    }
    // 建立魔方阵
    // 先把1放在第一行的中间位置
    a[0][(n-1)/2] = 1;
    // 起始位置为a[0][(n-1)/2]
    i = 0;
    j = (n - 1) / 2;
    for (k = 2; k <= n * n; k++)
    {
        // 基本原则：方下一个数的位置是[行减一，列加一]
        i -= 1;
        j += 1;
        // 若上一个数是第一行第n列，则位置转到上一数位置的下面
        if (i < 0 && j > n - 1)
        {
            i += 2;
            j -= 1;
        }
        else 
        {
            if (i < 0) i = n - 1;   // 若上一个数是第一行，则转到最后行
            if (j > n - 1) j = 0;   // 若上一个数是第n列，则转到第一行
        }
        // 正常情况
        if (a[i][j] == 0)
        {
            a[i][j] = k;
        }
        // 若此时位置有元素了，则位置转到上一数位置的下面
        else
        {
            i += 2;
            j -= 1;
            a[i][j] = k;
        }
    }
    // 输出魔方阵
    for (i = 0; i < n; i++)
    {
        for (j = 0; j < n; j++)
        {
            printf("%-4d", a[i][j]);
        }
        printf("\n");
    }
    system("pause");
    return 0;
}